{
  "format": "layers-model",
  "generatedBy": "TensorFlow.js v5.0.0",
  "convertedBy": "ChatGPT Dummy Model",
  "modelTopology": {
    "class_name": "Sequential",
    "config": {
      "name": "dummy_model",
      "layers": [
        {
          "class_name": "Dense",
          "config": {
            "name": "dense_Dummy1",
            "trainable": true,
            "units": 5,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": { "class_name": "VarianceScaling", "config": {} },
            "bias_initializer": { "class_name": "Zeros", "config": {} },
            "input_shape": [10]
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "name": "dense_Dummy2",
            "trainable": true,
            "units": 2,
            "activation": "softmax",
            "use_bias": true,
            "kernel_initializer": { "class_name": "VarianceScaling", "config": {} },
            "bias_initializer": { "class_name": "Zeros", "config": {} }
          }
        }
      ]
    }
  },
  "weightsManifest": [
    {
      "paths": ["group1-shard1of1.bin"],
      "weights": [
        { "name": "dense_Dummy1/kernel", "shape": [10,5], "dtype": "float32" },
        { "name": "dense_Dummy1/bias", "shape": [5], "dtype": "float32" },
        { "name": "dense_Dummy2/kernel", "shape": [5,2], "dtype": "float32" },
        { "name": "dense_Dummy2/bias", "shape": [2], "dtype": "float32" }
      ]
    }
  ]
}
